app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", ""], ["created_at", "2020-10-09 17:12:17.887588"], ["updated_at", "2020-10-09 17:12:17.887588"]]
---
  def create
    @article = Article.new(article_params)
    @article.save

SELECT  "articles".* FROM "articles" WHERE (20) LIMIT ?  [["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 19]]
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "ruby_logo.png"], ["image_file_size", 7010], ["image_updated_at", "2020-10-10 20:26:26.431823"], ["updated_at", "2020-10-10 20:26:26.437639"], ["id", 30]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(article_params)