app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("username", "email", "crypted_password", "salt", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @author.update(author_params)
---
UPDATE "authors" SET "salt" = ?, "crypted_password" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["salt", "XHQZuu2MusZ6Lj-e1Sm5"], ["crypted_password", "$2a$10$5fPLR4dHSdY/A9.2zbXXB.b5qjIsvWKzi8yLoCdIk3Z.38Boj/GPK"], ["updated_at", "2020-10-11 18:38:18.421714"], ["id", 1]]